//定时器学习练习，定时器控制led每隔1秒亮灭
#include "reg52.h"

sbit led = P3^6;
void main()
{
	int cnt = 0;
	
	led = 1;
	//1.配置定时器0工作模式为16位计时
	TMOD = 0x01;
	//2.给初值，定一个10ms出来
	TL0 = 0x00;
	TH0 = 0xDC;
	//3.开始计时
	TR0 = 1;
	TF0 = 0; 
	while(1){
		if(TF0 == 1)//当爆表的时候，硬件会修改bit5（TF0）位上面的数据，改成（置1），如果不用中断，我们代码清零
			{
				TF0 = 0;//不用中断，必须软件清零
				cnt++;//统计爆表次数
				//重新给初值
				TL0 = 0x00;
				TH0 = 0xDC;
				if(cnt == 100){//爆表100次，经过了1秒
					cnt = 0;//当爆表100次表示1s，重新让cnt从0开始计算下一次的1s
					led = !led;//每经过一秒翻转一下led的状态
				}
		}
	
	}
		//4.爆表了,操作led吗，累计到1s,再操作led

	//爆表了，变量加1，加100次就是1秒，每隔1s就转换led状态
	
}